<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"meta","backend":"37e98cf80024cfa991f279ab31a6f7e9d835c050137a4d6d9710a54b4fdc9f4e","plan_job_ref":"Job Pull Request Checks #3253 at https://github.com/GSA-TTS/FAC/actions/runs/9765715553","plan_out_hash":"2e941398c743493c98eaab6a192fe397cd0fc29862c96bb34b1820994034885b","plan_hash":"e7e7f9db7886f6b1a64d69f1dc771ac52c350072f489567aec3824a34805e2d0","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan for __meta__
<details>
<summary>Plan: 4 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.environments["dev"].cloudfoundry_space.space will be updated in-place
!~  resource "cloudfoundry_space" "space" {
+       delete_recursive_allowed = true
        id                       = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
        name                     = "dev"
#        (11 unchanged attributes hidden)
    }

  # module.environments["dev"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../dev/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["preview"].cloudfoundry_space.space will be updated in-place
!~  resource "cloudfoundry_space" "space" {
+       delete_recursive_allowed = true
        id                       = "c21cdcb1-b760-4f3e-968d-469819b448e9"
        name                     = "preview"
#        (11 unchanged attributes hidden)
    }

  # module.environments["preview"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../preview/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["production"].cloudfoundry_space.space will be updated in-place
!~  resource "cloudfoundry_space" "space" {
+       delete_recursive_allowed = true
        id                       = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
        name                     = "production"
#        (11 unchanged attributes hidden)
    }

  # module.environments["production"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../production/providers-managed.tf"
+       id                   = (known after apply)
    }

  # module.environments["staging"].cloudfoundry_space.space will be updated in-place
!~  resource "cloudfoundry_space" "space" {
+       delete_recursive_allowed = true
        id                       = "7bbe587a-e8ee-4e8c-b32f-86d0b0f1b807"
        name                     = "staging"
#        (11 unchanged attributes hidden)
    }

  # module.environments["staging"].local_file.providers-tf will be created
+   resource "local_file" "providers-tf" {
+       content              = <<-EOT
            # The content of this file is managed by Terraform. If you modify it, it may
            # be reverted the next time Terraform runs. If you want to make changes, do it
            # in ../meta/bootstrap-env/templates.
            
            terraform {
              required_version = "~> 1.0"
              required_providers {
                cloudfoundry = {
                  source  = "cloudfoundry-community/cloudfoundry"
                  version = "~>0.53.1"
                }
              }
            
              backend "s3" {
                # The rest of the backend parameters must be supplied when you initialize:
                #   terraform init --backend-config=../shared/config/backend.tfvars \
                #    --backend-config=key=terraform.tfstate.$(basename $(pwd))
                #
                # For more info, see:
                # https://developer.hashicorp.com/terraform/language/settings/backends/configuration#partial-configuration
                encrypt = "true"
              }
            }
            
            provider "cloudfoundry" {
              api_url  = "https://api.fr.cloud.gov"
              user     = var.cf_user
              password = var.cf_password
            }
        EOT
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0644"
+       filename             = "./../staging/providers-managed.tf"
+       id                   = (known after apply)
    }

Plan: 4 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #3253](https://github.com/GSA-TTS/FAC/actions/runs/9765715553)